package org.smu.blood.model

enum class Hospital(
    val id: Int,
    val hospitalName: String,
    val latitude: Double,
    val logitude: Double
) {
    HOSPITAL_1(
        1,
        "강남연세사랑병원",
        37.47668207240237,
        126.9867632323917
    ),
    HOSPITAL_2(
        2,
        "강남힘찬병원",
        37.50756717691139,
        127.10992197655135
    ),
    HOSPITAL_3(
        3,
        "강북힘찬병원",
        37.64563444869913,
        127.03321859956753
    ),
    HOSPITAL_4(
        4,
        "강서힘찬병원",
        37.55932815683345,
        126.84060304240047
    ),
    HOSPITAL_5(
        5,
        "강동성심병원",
        37.53623579906633,
        127.13526462704681
    ),
    HOSPITAL_6(
        6,
        "강남성심병원",
        37.492793432212835,
        37.49114981693702
    ),
    HOSPITAL_7(
        7,
        "강남성심병원 (신관)",
        37.49114981693702,
        126.90717045300246
    ),
    HOSPITAL_8(
        8,
        "강동경희대학교병원",
        37.55348577017648,
        127.15764537131092
    ),
    HOSPITAL_9(
        9,
        "건국대학교병원",
        37.54081781433152,
        127.07221647984983
    ),
    HOSPITAL_10(
        10,
        "고려대학교의료원안암병원",
        37.58703944573309,
        127.02654322858608
    ),
    HOSPITAL_11(
        11,
        "고려대학교구로병원",
        37.492219998055674,
        126.88495345614182
    ),
    HOSPITAL_12(
        12,
        "고려대학교안산병원",
        37.3191434119895,
        126.82526576814976
    ),
    HOSPITAL_13(
        13,
        "가톨릭관동대학교국제성모병원",
        37.54233193785027,
        126.68357339022164
    ),
    HOSPITAL_14(
        14,
        "국립암센터",
        37.663234,
        126.783345
    ),
    HOSPITAL_15(
        15,
        "광명성애병원",
        37.473516,
        126.871839
    ),
    HOSPITAL_16(
        16,
        "광명21세기병원",
        37.484685,
        126.856341
    ),
    HOSPITAL_17(
        17,
        "김포우리병원 (우리의료재단)",
        37.63241010276343,
        126.71079413969254
    ),
    HOSPITAL_18(
        18,
        "가은병원",
        37.477456,
        126.768837
    ),
    HOSPITAL_19(
        19,
        "경희의료원",
        37.59388695234703,
        127.05133179978583
    ),
    HOSPITAL_20(
        20,
        "가천의대부속동인천길병원",
        37.473662,
        126.631291
    ),
    HOSPITAL_21(
        21,
        "국제나은병원 (안양)",
        37.392871,
        126.925649
    ),
    HOSPITAL_22(
        22,
        "뉴고려병원 (인봉의료재단)",
        37.641050,
        126.660325
    ),
    HOSPITAL_23(
        23,
        "목동힘찬병원",
        37.5249618918768,
        126.87679967490885
    ),
    HOSPITAL_24(
        24,
        "명지병원 (화정)",
        37.642131,
        126.831226
    ),
    HOSPITAL_25(
        25,
        "부천성모병원 (가톨릭)",
        37.486982,
        126.792375
    ),
    HOSPITAL_26(
        26,
        "부평힘찬병원",
        37.492357, 126.729975
    ),
    HOSPITAL_27(
        27,
        "부천세종병원 (혜원의료재단)",
        37.481117, 126.791391
    ),
    HOSPITAL_28(
        28,
        "서울아산병원",
        37.527511354376344,
        127.109096000744
    ),
    HOSPITAL_29(
        29,
        "신촌세브란스병원 (연세의료원)",
        37.56234349074328,
        126.94086527961909
    ),
    HOSPITAL_30(
        30,
        "서울대학교병원",
        37.579547092107504,
        126.99906034440808
    ),
    HOSPITAL_31(
        31,
        "서울대학교병원어린이병원",
        37.57934303139017,
        127.00050271306475
    ),
    HOSPITAL_32(
        32,
        "서울성모병원 (가톨릭)",
        37.5017816924235,
        127.00478170059976
    ),
    HOSPITAL_33(
        33,
        "삼성서울병원 (본원)",
        37.488948492747305,
        127.08764310917212
    ),
    HOSPITAL_34(
        34,
        "삼성서울병원 암병원",
        37.48891117008248,
        127.08789197831823
    ),
    HOSPITAL_35(
        35,
        "시화병원 (남촌의료재단)",
        37.350025, 126.736886
    ),
    HOSPITAL_36(
        36,
        "성애병원 (신길)",
        37.511966908482435,
        126.92238895573908
    ),
    HOSPITAL_37(
        37,
        "안양샘병원 (효산의료재단)",
        37.393474, 126.924505
    ),
    HOSPITAL_38(
        38,
        "아주대학교병원",
        37.278763, 127.046297
    ),
    HOSPITAL_39(
        39,
        "여의도성모병원 (가톨릭)",
        37.51744157511374,
        126.93506125993063
    ),
    HOSPITAL_40(
        40,
        "의정부성모병원 (가톨릭)",
        37.758630, 127.077714
    ),
    HOSPITAL_41(
        41,
        "인천성모병원 (가톨릭)",
        37.484280, 126.725176
    ),
    HOSPITAL_42(
        42,
        "일산백병원 (일산백병원)",
        37.674282, 126.750318
    ),
    HOSPITAL_43(
        43,
        "일산21세기병원",
        37.644020, 126.786202
    ),
    HOSPITAL_44(
        44,
        "안산21세기병원",
        37.330548, 126.831716
    ),
    HOSPITAL_45(
        45,
        "인천힘찬종합병원",
        37.414726, 126.677483
    ),
    HOSPITAL_46(
        46,
        "원광대학교의과대학산본병원",
        37.359346, 126.933593
    ),
    HOSPITAL_47(
        47,
        "은평성모병원 (가톨릭)",
        37.63384999074391,
        126.91655915777957
    ),
    HOSPITAL_48(
        48,
        "연세본사랑병원 (전 부천연세사랑)",
        37.489648, 126.783510
    ),
    HOSPITAL_49(
        49,
        "이화여자대학교의과대학부속 서울병원",
        37.5579008384366,
        126.83666540587318
    ),
    HOSPITAL_50(
        50,
        "이대목동병원",
        37.53638693421091,
        126.88642254991737
    ),
    HOSPITAL_51(
        51,
        "일산병원 (국민건강보험공단)",
        37.645495, 126.793013
    ),
    HOSPITAL_52(
        52,
        "지샘병원 (효산의료재단)",
        37.358652, 126.947294
    ),
    HOSPITAL_53(
        53,
        "최원호병원",
        37.60471552525695,
        126.92381679730522
    ),
    HOSPITAL_54(
        54,
        "참조은병원 (경기도 광주)",
        37.410912, 127.260177
    ),
    HOSPITAL_55(
        55,
        "척편한병원",
        37.48269391615752,
        126.93010367335236
    ),
    HOSPITAL_56(
        56,
        "한강성심병원 (일송학원)",
        37.523371835387806,
        126.91058215100577
    ),
    HOSPITAL_57(
        57,
        "한양대학교구리병원",
        37.60120080369273,
        127.13236945818932
    ),
    HOSPITAL_58(
        58,
        "한림대학교성심병원 (평촌)",
        37.391606, 126.961949
    ),
    HOSPITAL_59(
        59,
        "한림대학교성심병원 (동탄)",
        37.216661, 127.080123
    ),
    HOSPITAL_60(
        60,
        "혜민병원",
        37.535336333652666,
        127.08354151925478
    ),
    HOSPITAL_61(
        61,
        "희명병원",
        37.45567017986422,
        126.90059322938235
    ),
}